'''
Вы начали задумываться о том, какой процент вашей зарплаты относится к средней
заработной плате на данном типе трудоустройства во всех компаниях.
Реализуйте методы/функции, которые будут вычислять среднюю зарплату для определенного
типа трудоустройства и определять процентное отношение данной зарплаты к средней зарплате

Пример: Средняя зарплата в типе трудоустройства:” контракт ” – 40000 руб.

(44000)/ (40000) *100% = 110%

 “44000            , контракт, 35498, дизайнер взаимодействия, Avantor” → “ 44000, контракт, 35498, дизайнер взаимодействия, Avantor, 110%”

На вход подается CSV файл, который необходимо записать в список, для каждого элемента посчитать среднюю заработную плату, после чего дополнить список сгенерированными элементами, столбец необходимо назвать percent. Последним этапом полученный список записать в новый vacancy_procent.csv  файл.

Не забудьте сделать комментарии к коду согласно стандартам документирования кода выбранного языка. После выполнения необходимо сделать локальные и удаленные изменения Вашего репозитория
'''